In [2]:
import numpy as np
from IPython.display import display
import pandas as pd

In [5]:
pd_series = pd.Series([10, 100, 15, 35, 35])
print(pd_series)
print(type(pd_series))

np1 = np.array([10, 100, 15, 35, 35])
np1  # no index presented

0     10
1    100
2     15
3     35
4     35
dtype: int64
<class 'pandas.core.series.Series'>

array([ 10, 100,  15,  35,  35])

In [41]:

# create label index
pd_series = pd.Series(data=[1776, 1867, 1821] , index=['USA', 'CANADA', 'MEXICO'])
print(pd_series)
print()

# remove index
# pd_series = pd_series.reset_index(drop=True)
pd_series.reset_index(drop=True, inplace=True)
display(pd_series)
display(pd_series[0])
print()

# restore index
pd_series.index = ["USA", "CANADA", "MEXICO"]
display(pd_series)

print()
display(pd_series.iloc[0])
display('CANADA', pd_series['CANADA'])

print()
display(pd_series.values)
display(pd_series.index)

USA       1776
CANADA    1867
MEXICO    1821
dtype: int64

0    1776
1    1867
2    1821
dtype: int64

1776

USA       1776
CANADA    1867
MEXICO    1821
dtype: int64

1776

'CANADA'

1867

array([1776, 1867, 1821], dtype=int64)

Index(['USA', 'CANADA', 'MEXICO'], dtype='object')

In [46]:
# create label index
pd_series = pd.Series({'USA':1776, 'CANADA': 1867, 'MEXICO': 1823})
print(pd_series)
print()
print(pd_series.keys())
print(pd_series.index)

USA       1776
CANADA    1867
MEXICO    1823
dtype: int64

Index(['USA', 'CANADA', 'MEXICO'], dtype='object')
Index(['USA', 'CANADA', 'MEXICO'], dtype='object')

In [ ]:
# create Series
# store1
# Laptop  3000
# Screen  1000
# Audio    500

# store2
# Screen   300
# Audio    800
# Mouse     50

# create 2 Series for the stores above (1st from list, 2nd from dict)
# print the price of the 'Laptop' from the 1st store use []
# print the price of the 'Audio' from the 2nd store use []
# add the prices (using add function) and print the results

# pd_series = pd.Series(data=[1776, 1867, 1821] , index=['USA', 'CANADA', 'MEXICO']) === list
# pd_series = pd.Series({'USA':1776, 'CANADA': 1867, 'MEXICO': 1823}) === dict

In [58]:
first_series = pd.Series({'Japan': 100, 'China': 450, 'USA': 250})
second_series = pd.Series({'Brazil': 70, 'China': 350, 'USA': 200})

print('\nfirst_series.dtype', first_series.dtype)

concat_series = first_series.add(second_series, fill_value=0)
print('\nconcat_series')
print(concat_series)  # after add the type becomes float

print('\nconcat_series.astype(int)')
print(concat_series.astype(int))

first_series.dtype int64

concat_series
Brazil     70.0
China     800.0
Japan     100.0
USA       450.0
dtype: float64

concat_series.astype(int)
Brazil     70
China     800
Japan     100
USA       450
dtype: int32

In [67]:
np.random.seed(100)
my_data = np.random.randint(0, 101, (4, 3))

# display(pd.DataFrame(my_data))
pd.DataFrame(my_data)

    0   1   2
0   8  24  67
1  87  79  48
2  10  94  52
3  98  53  66

In [99]:
np.random.seed(100)
my_data = np.random.randint(0, 101, (4, 3))
row_index = ['CA', 'NY', 'AZ', 'TX']
col_names = ['Jan', 'Feb', 'Mar']
             
df = pd.DataFrame(my_data, index=my_index, columns=col_names)
display(df)

# index by row name == df.loc
# index by column name = df['column-name']
# index by numeric location == df.iloc
# index and range == df.iloc[ : ]  df.loc[ : ]

display(type(df.loc['AZ']))
print("\n== df.loc['AZ']")
display(df.loc['AZ'])
print()
display(type(df['Jan']))
print()
print("\n== df['Jan']")
display(df['Jan'])
print()

display(df.iloc[0])  # first-row 

print("\n=== df.loc['NY':'AZ']")
display(df.loc['NY':'AZ'])

print("\n=== df.iloc[:3]")  # first 3 rows
display(df.iloc[:3])

print("\n=== df.iloc[::-1]")  # reverse
display(df.iloc[::-1])

    Jan  Feb  Mar
CA    8   24   67
NY   87   79   48
AZ   10   94   52
TX   98   53   66

pandas.core.series.Series

== df.loc['AZ']

Jan    10
Feb    94
Mar    52
Name: AZ, dtype: int32

pandas.core.series.Series

== df['Jan']

CA     8
NY    87
AZ    10
TX    98
Name: Jan, dtype: int32

Jan     8
Feb    24
Mar    67
Name: CA, dtype: int32

=== df.loc['NY':'AZ']

    Jan  Feb  Mar
NY   87   79   48
AZ   10   94   52

=== df.iloc[:3]

    Jan  Feb  Mar
CA    8   24   67
NY   87   79   48
AZ   10   94   52

=== df.iloc[::-1]

    Jan  Feb  Mar
TX   98   53   66
AZ   10   94   52
NY   87   79   48
CA    8   24   67

In [105]:
np.random.seed(100)
my_data = np.random.randint(0, 101, (4, 3))
row_index = ['CA', 'NY', 'AZ', 'TX']
col_names = ['Jan', 'Feb', 'Mar']

df = pd.DataFrame(my_data, index=my_index, columns=col_names)
display(df)

df[['Jan', 'Feb']]  # multi column
# rows AZ to Tx column feb
# rows CA to AZ column Jan, feb
# rows 0..2 column Jan
# *bonus: rows 0..2 column 0..1

    Jan  Feb  Mar
CA    8   24   67
NY   87   79   48
AZ   10   94   52
TX   98   53   66

    Jan  Feb
CA    8   24
NY   87   79
AZ   10   94
TX   98   53